java/soap2bodies/output/document_body.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body xmlns:ns="http://example.com">
        <Customer xmlns="http://doc.com">Alice</Customer>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>